#ifndef _GPRS_SOCKET_H
#define _GPRS_SOCKET_H


 

/****  连接socket  ***********************************
** 函数名称:   SocketConnect
** 功能描述:   连接socket
** 输入:	   char *ip       --  服务器IP地址,格式x.x.x.x
**             uint16_t port  --  服务器端口号
** 输出:	  1：连接成功
**            0: 正在连接
**           -1：连接失败
**           -2: 模块故障
** 全局变量:
** 调用模块:
** 备注:
** 作者:	   杜其俊
** 日期:	   20160815
******************************************************************/
extern int8_t GprsSocketConnect(char *ip, uint16_t port);

/****  关闭socket  ***********************************
** 函数名称:   SocketClose
** 功能描述:   关闭socket
** 输入:	   无
** 输出:	  1：关闭成功
**            0: 正在关闭
**           -1：关闭失败
** 全局变量:
** 调用模块:
** 备注:
** 作者:	   杜其俊
** 日期:	   20160815
******************************************************************/
extern int8_t GprsSocketClose(void);

/****  向socket发送数据  ***********************************
** 函数名称:   socket_send
** 功能描述:   向socket发送数据
** 输入:	   uint8_t *data  --  发送的数据
**             uint32_t len   --  发送的数据长度
** 输出:	 >0：发送成功的数据个数
**            0: 系统忙, 数据没有发送成功
**           -1: 发送失败, socket没有连上
**           -2：模块故障
** 全局变量:
** 调用模块:
** 备注:
** 作者:	   杜其俊
** 日期:	   20160815
******************************************************************/
extern int32_t GprsSocketSend(uint8_t *data, uint32_t len);


/****  读socket的数据  ***********************************
** 函数名称:   socket_read
** 功能描述:   读socket的数据
** 输入:	   uint8_t *data  --  接收数据时的缓存
**             uint32_t len   --  接收的数据的最大个数
** 输出:	>=0：接收成功的数据个数
**           -1: 接收失败, socket没有连上
**           -2：模块故障
** 全局变量:
** 调用模块:
** 备注:
** 作者:	   杜其俊
** 日期:	   20160815
******************************************************************/
extern int32_t GprsSocketRead(uint8_t *data, uint32_t len_max);


extern int8_t GprsReturnSocketTCPState(void);

#endif

